export default function handle(req, res) {
  res.json({
    title: 'Hello this is daily-news',
    fetch: [
      {
        title: 'ประธาน Xbox เผย ความสำเร็จของพวกเขาไม่ได้มาจากการโค่น Sony',
        description: [
          'โดยปกติสิ่งที่เราได้เห็นกันในวงการเกมคอนโซลคือการออกมาแข่งขันกันอย่างดุเดือดระหว่างค่ายใหญ่ ไม่ว่าจะเป็น Sega กับ Nintendo หรือ Sony กับ Microsoft ในสมัยก่อนที่มีการข่มหรือใช้ทุกวิถีทางเพื่อให้ตัวเองมีชัยเหนือคู่แข่ง แต่ดูเหมือนว่าในยุคนี้ Microsoft จะเริ่มมีการเปลี่ยนแปลงในทิศทางที่ตัวเองจะเลือกเดิน และมองว่าการโค่น Sony ลงจากตำแหน่งนั้นไม่ใช่เป้าหมายหลักอีกต่อไปแล้ว',
          'Phil Spencer ประธานของ Xbox จาก Microsoft ได้พูดถึงเรื่องนี้จากการสัมภาษณ์ของนิตยสาร Fortune Magazine ในคำถามที่ว่า คิดเห็นอย่างไรกับคู่แข่งจำนวนมหาศาลที่อยู่ในตลาดตอนนี้ ทั้ง Sony, Nintendo หรือกระทั่ง Google ที่ส่ง Stadia มาลุยในสังเวียนด้วย ซึ่งเขามองว่าการโค่นคู่แข่งให้ล้มหายไปนั้นไม่ใช่ทิศทางที่ดีนักสำหรับอุตสาหกรรมเกมในตอนนี้ ',
          'ที่ผมจะบอกก็คือ เราไม่ได้มองใครเป็นคู่แข่งเลย” Spencer กล่าว “ผมรับฟังคอมมูนิตี้ของผู้เล่นอยู่เสมอ แต่ใครก็ตามที่อยากจะเห็นคู่แข่งล้มหายตายจากไปในนามของทีมสีเขียวนั้น บอกเลยว่าไม่ได้มาจากผมแน่นอน ซึ่งผมก็เห็นในโลกออนไลน์แหละครับว่ามีคนบางคนที่มองว่า การที่พวกเราไปร่วมมือกับ Sony แล้วก็มาถามเราว่า ‘พวกคุณทำอะไร แล้วไปช่วยพวกเขาทำไม?',
          'และในเรื่องนี้ก็เหมือนกันครับ เราใช้เวลาหลายปีในการสานสัมพันธ์กับทาง Sony พวกเขาขายเครื่อง PC ที่ซึ่งมี Windows ของพวกเราอยู่ในนั้น พวกเขาใช้เครื่องมือของพวกเราในการสร้างเกม และความคิดที่มุ่งหวังว่าจะดึงใครก็ตามให้ล้มหายตายจากไปจากวงการนั้นไม่ใช่วิถีทางของการอยู่รอดในอุตสาหกรรมนี้อีกแล้ว',
          'หลังจากคุณ Spencer ตอยคำถามนี้ไป เขาก็เปลี่ยนเรื่องพูดทันที โดยเขาได้บอกว่า ในเรื่องนี้พวกเขาต้องขอบคุณทีม Mojang ที่พัฒนา Minecraft ขึ้นมา และด้วยยอดขายที่ถล่มทลายบน PS4 ทำให้พวกเขากลายเป็นผู้จัดจำหน่ายเกมรายใหญ่ของทาง Sony ไปโดยปริยาย',
          '“พวกเราคือผู้จัดจำหน่ายเกมเจ้าใหญ่เจ้าหนึ่งของ PlayStation เลยล่ะครับ” เขากล่าว “เพราะเราส่ง Minecraft ไปขายที่นั่น ธุรกิจของพวกเราระหว่าง Sony PlayStation และ Nintendo Switch นั้นยอดเยี่ยมมากครับ”',
          'phil-spencerถือเป็นวิสัยทัศน์ที่ยอดเยี่ยมที่มาจากแนวคิดที่มุ่งหวังให้วงการเกมพัฒนาไปอย่างแท้จริง เพราะไม่ได้มีเพียงแค่การแข่งขันเท่านั้น แต่คุณ Spencer ยังหมายรวมไปถึงการร่วมมือกับบริษัทในอุตสาหกรรมเดียวกันอีกด้วย น่าติดตามว่าหลังจากนี้ทาง Microsoft จะไปได้ไกลอีกแค่ไหนในวงการเกมต่อจากนี้ครับ'
        ],
        image: [
          'https://www.gamingdose.com/wp-content/uploads/2019/03/xbox-playstation.jpg',
          'https://www.gamingdose.com/wp-content/uploads/2018/06/phil-spencer.jpeg'
        ],
        datetime: '2019-07-29T17:57:11+07:00',
        provider: 'gamingdose'
      }
    ]
  })
}
