export default function handle(req, res) {
  res.json({
    title: 'Hello this is daily-news',
    fetch: [
      {
        title: 'ประธาน Xbox เผย ความสำเร็จของพวกเขาไม่ได้มาจากการโค่น Sony',
        description: [
          'โดยปกติสิ่งที่เราได้เห็นกันในวงการเกมคอนโซลคือการออกมาแข่งขันกันอย่างดุเดือดระหว่างค่ายใหญ่ ไม่ว่าจะเป็น Sega กับ Nintendo หรือ Sony กับ Microsoft ในสมัยก่อนที่มีการข่มหรือใช้ทุกวิถีทางเพื่อให้ตัวเองมีชัยเหนือคู่แข่ง แต่ดูเหมือนว่าในยุคนี้ Microsoft จะเริ่มมีการเปลี่ยนแปลงในทิศทางที่ตัวเองจะเลือกเดิน และมองว่าการโค่น Sony ลงจากตำแหน่งนั้นไม่ใช่เป้าหมายหลักอีกต่อไปแล้ว',
          'Phil Spencer ประธานของ Xbox จาก Microsoft ได้พูดถึงเรื่องนี้จากการสัมภาษณ์ของนิตยสาร Fortune Magazine ในคำถามที่ว่า คิดเห็นอย่างไรกับคู่แข่งจำนวนมหาศาลที่อยู่ในตลาดตอนนี้ ทั้ง Sony, Nintendo หรือกระทั่ง Google ที่ส่ง Stadia มาลุยในสังเวียนด้วย ซึ่งเขามองว่าการโค่นคู่แข่งให้ล้มหายไปนั้นไม่ใช่ทิศทางที่ดีนักสำหรับอุตสาหกรรมเกมในตอนนี้ ',
          'ที่ผมจะบอกก็คือ เราไม่ได้มองใครเป็นคู่แข่งเลย” Spencer กล่าว “ผมรับฟังคอมมูนิตี้ของผู้เล่นอยู่เสมอ แต่ใครก็ตามที่อยากจะเห็นคู่แข่งล้มหายตายจากไปในนามของทีมสีเขียวนั้น บอกเลยว่าไม่ได้มาจากผมแน่นอน ซึ่งผมก็เห็นในโลกออนไลน์แหละครับว่ามีคนบางคนที่มองว่า การที่พวกเราไปร่วมมือกับ Sony แล้วก็มาถามเราว่า ‘พวกคุณทำอะไร แล้วไปช่วยพวกเขาทำไม?',
          'และในเรื่องนี้ก็เหมือนกันครับ เราใช้เวลาหลายปีในการสานสัมพันธ์กับทาง Sony พวกเขาขายเครื่อง PC ที่ซึ่งมี Windows ของพวกเราอยู่ในนั้น พวกเขาใช้เครื่องมือของพวกเราในการสร้างเกม และความคิดที่มุ่งหวังว่าจะดึงใครก็ตามให้ล้มหายตายจากไปจากวงการนั้นไม่ใช่วิถีทางของการอยู่รอดในอุตสาหกรรมนี้อีกแล้ว',
          'หลังจากคุณ Spencer ตอยคำถามนี้ไป เขาก็เปลี่ยนเรื่องพูดทันที โดยเขาได้บอกว่า ในเรื่องนี้พวกเขาต้องขอบคุณทีม Mojang ที่พัฒนา Minecraft ขึ้นมา และด้วยยอดขายที่ถล่มทลายบน PS4 ทำให้พวกเขากลายเป็นผู้จัดจำหน่ายเกมรายใหญ่ของทาง Sony ไปโดยปริยาย',
          '“พวกเราคือผู้จัดจำหน่ายเกมเจ้าใหญ่เจ้าหนึ่งของ PlayStation เลยล่ะครับ” เขากล่าว “เพราะเราส่ง Minecraft ไปขายที่นั่น ธุรกิจของพวกเราระหว่าง Sony PlayStation และ Nintendo Switch นั้นยอดเยี่ยมมากครับ”',
          'phil-spencerถือเป็นวิสัยทัศน์ที่ยอดเยี่ยมที่มาจากแนวคิดที่มุ่งหวังให้วงการเกมพัฒนาไปอย่างแท้จริง เพราะไม่ได้มีเพียงแค่การแข่งขันเท่านั้น แต่คุณ Spencer ยังหมายรวมไปถึงการร่วมมือกับบริษัทในอุตสาหกรรมเดียวกันอีกด้วย น่าติดตามว่าหลังจากนี้ทาง Microsoft จะไปได้ไกลอีกแค่ไหนในวงการเกมต่อจากนี้ครับ'
        ],
        image: [
          'https://www.gamingdose.com/wp-content/uploads/2019/03/xbox-playstation.jpg',
          'https://www.gamingdose.com/wp-content/uploads/2018/06/phil-spencer.jpeg'
        ],
        datetime: '2019-07-29T17:57:11+07:00',
        provider: 'gamingdose'
      },
      {
        title:
          'มาอีกประเทศ! ฝรั่งเศสเตรียมติดตั้งอาวุธปืนและเลเซอร์ลงในดาวเทียมก่อนปี 2030 นี้',
        description: [
          'ถ้าหากเราจินตนาการถึงอาวุธทั้งหลายในโลกอนาคต เชื่อว่าสิ่งหนึ่งเราจะคิดถึงกันก่อนเพราะเห็นภาพจำจากสื่อต่าง ๆ มานานก็คืออาวุธดาวเทียม ซึ่งดูเหมือนว่าในเวลานี้ประเทศมหาอำนาจต่าง ๆ เริ่มที่จะผลักดันให้มีการพัฒนาอาวุธที่ติดตั้งลงในดาวเทียมของตนอย่างมาก รวมไปถึงฝรั่งเศสด้วยเช่นกัน',
          'รายงานจากเว็บไซต์ The Verge ระบุว่า ก่อนหน้านี้ทางประธานาธิบดีของประเทศฝรั่งเศส Emmanuel Macron ได้ประกาศว่ากองทัพอากาศของฝรั่งเศสกำลังจะมีการเพิ่มการทำงานในส่วนของอวกาศเพิ่มขึ้นมาในอนาคต เพื่อเอาไว้ใช้ป้องกันระบบดาวเทียมของตน และทางกองทัพอากาศของฝรั่งเศสเองก็มีความจริงจังในเรื่องดังกล่าวนี้อย่างมาก',
          'ซึ่งเพื่อให้การควบคุมต่าง ๆ เป็นไปได้ด้วยดี ทางกระทรวงกลาโหมของฝรั่งเศสจึงจัดสรรงบประมาณจำนวน 700 ล้านยูโรหรือประมาณ 24,500 ล้านบาทไทยในการวิจัยและพัฒนาระบบดาวเทียมที่มีการติดอาวุธปืนและเลเซอร์ เพื่อเอาไว้ใช้ป้องกันระบบดาวเทียมและการโจมตีด้วยขีปนาวุธของข้าศึก โดยมีการกำหมดเป้าหมายว่าจะต้องสำเร็จให้ได้ก่อนปี 2030',
          'นอกจากงบประมาณ 700 ล้านยูโรแล้ว ทางกระทรวงกลาโหมฝรั่งเศสยังเตรียมที่จะอัดฉีดงบประมาณเพื่อโครงการดังกล่าวนี้เพิ่มไปอีกรวมทั้งหมด 4.3 พันล้านยูโรหรือ 150,500 ล้านบาทไทย ซึ่งนอกจากการติดตั้งระบบอาวุธลงในดาวเทียมแล้ว งบส่วนนี้ยังถูกนำไปใช้เพื่อการพัฒนาระบบดาวเทียมแบบนาโนเพื่อใช้ในการวางแผนทางยุทธวิธี รวมไปถึงใช้สร้างฐานส่งดาวเทียมแบบเร่งด่วนแทนตัวเก่าได้ทันทีอีกด้วย',
          'ข้อมูลเพิ่มเติมจาก Task & Purpose ยังระบุเพิ่มเติมว่า ทางฝรั่งเศสไม่ได้มุ่งเน้นให้ระบบดังกล่าวนี้นำไปใช้งานในเชิงรุก เช่นทำลายดาวเทียมของจ้าศึกบนอวกาศ ซึ่งจุดประสงค์ของพวกเขาคือการใช้อาวุธดังกล่าวนี้ในการปกป้องประเทศ ซึ่งเป็นจุดมุ่งหมายเดียวกัยที่ทางสหรัฐฯเคยวางเอาไว้ในโครงการวิจัยระบบดาวเทียมของตนเช่นกัน'
        ],
        image: [
          'https://www.gamingdose.com/wp-content/uploads/2019/05/pentagon-orbital-space-weapon-1200x597.jpg',
          'https://www.gamingdose.com/wp-content/uploads/2019/07/Asuransatelliteweapon2.jpg',
          'https://www.gamingdose.com/wp-content/uploads/2019/07/space-laser-weapon.jpg'
        ],
        datetime: '2019-07-29T15:45:09+07:00',
        provider: 'gamingdose'
      },
      {
        title:
          'แฮกเกอร์ดัดแปลงเครื่อง Nintendo Switch ให้สามารถใช้งาน Android ได้แล้ว',
        description: [
          'หากจำกันได้ ในปีที่แล้วมีข่าวออกมาว่าเครื่อง Nintendo Switch นั้นได้ถูกเจาะระบบภายในไปแล้วเรียบร้อย ซึ่งเปิดโอกาสให้เหล่าแฮกเกอร์สามารถลงโปรแกรมหรือระบบปฏิบัติการอื่น ๆ ในเครื่องได้ทันที ซึ่งก็มีแฮกเกอร์รายหนึ่งสามารถลงระบบปฏิบัติการ Android บน Nintendo Switch ได้เป็นผลสำเร็จแล้ว',
          'โดยคลิปด้านบนนี้มาจากผู้ใช้งาน xdadevelopers บน YouTube ที่แสดงให้เห็นถึงวิธีการรันระบบปฏิบัติการ Android ผ่านเครื่อง Nintendo Switch ซึ่งเป็นการรันผ่าน SD Card โดยที่ไม่ได้ทำการติดตั้งลงเครื่อง Nintendo Switch แต่อย่างใด แถมยังสามารถใช้งาน App ต่าง ๆ ได้อย่างปกติอีกด้วย',
          'ที่สำคัญคือตัว Joy Con นั้นยังสามารถใช้งานได้ตามปกติ แถมถ้าหากเชื่อมต่อกับ Docking ผ่านโทรทัศน์ก็จะใช้งาน App อย่าง Netflix รับชมแบบจอใหญ่ได้อีกด้วย เรียกว่าเกือบเป็นเครื่องเล่นเกมสารพัดประโยชน์ที่มีฟังก์ชั่นการทำงานไม่น้อยหน้าเครื่องเกมคอนโซลตัวอื่น ๆ เลยแม้แต่น้อย',
          'อย่างไรก็ตาม ตัวเครื่องนั้นไม่รองรับการใช้งานทั้ง GPS ไมโครโฟรหรือกล้องถ่ายรูป ทำให้การใช้งาน App บางตัวไม่สามารถทำได้ และนอกจากนั้นยังมี Bug บางอย่างในตัวเครื่องติดมาอีกด้วย แต่ถ้าสนใจอยากลองและไม่กลัวว่าจะถูกแบน ก็สามารถดูรายละเอียดต่าง ๆ ทั้งหมดได้ ที่นี่'
        ],
        image: [
          'https://www.gamingdose.com/wp-content/uploads/2019/07/switch-android.jpg',
          'https://www.gamingdose.com/wp-content/uploads/2018/11/switchzelda.jpg'
        ],
        datetime: '2019-07-29T13:55:28+07:00',
        provider: 'gamingdose'
      }
    ]
  })
}
